Console.WriteLine("Введите первое число от 0 до 4 где 0-пики 1-трефы 2- червы 3 - бубны");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число от 0 до 9 где 0-шестерка 1-семерка 2-восьмерка 3-девятка 4-десятка 5-валет 6-дама 7-король 8-туз");
int b = Convert.ToInt32(Console.ReadLine());

string[,] cart = new string[4, 9];
cart[0,0] = "шестерка пики";
cart[0,1] = "семерка пики";
cart[0,2] = "восьмерка пики";
cart[0,3] = "девятка пики";
cart[0,4] = "десятка пики";
cart[0,5] = "валет пики";
cart[0,6] = "дама пики";
cart[0,7] = "король пики";
cart[0,8] = "туз пики";

cart[1,0] = "шестерка трефы";
cart[1,1] = "семерка трефы";
cart[1,2] = "восьмерка трефы";
cart[1,3] = "девятка трефы";
cart[1,4] = "десятка трефы";
cart[1,5] = "валет трефы";
cart[1,6] = "дама трефы";
cart[1,7] = "король трефы";
cart[1,8] = "туз трефы";

cart[2,0] = "шестерка червы";
cart[2,1] = "семерка червы";
cart[2,2] = "восьмерка червы";
cart[2,3] = "девятка червы";
cart[2,4] = "десятка червы";
cart[2,5] = "валет червы";
cart[2,6] = "дама червы";
cart[2,7] = "король червы";
cart[2,8] = "туз червы";

cart[3,0] = "шестерка бубны";
cart[3,1] = "семерка бубны";
cart[3,2] = "восьмерка бубны";
cart[3,3] = "девятка бубны";
cart[3,4] = "десятка бубны";
cart[3,5] = "валет бубны";
cart[3,6] = "дама бубны";
cart[3,7] = "король бубны";
cart[3,8] = "туз бубны";
Console.WriteLine(cart[a, b]);